# 1)შექმენი for ციკლი რომელიც გამოიტანს ციფრებს 15მდე

# 2)შექმენი for ციკლი რომელიც დაბეჭდავს "Hello World"-ს 10ჯერ

# 3)შექმენი while ციკლი და გამოიტანე "Hello" 5-ჯერ


# for i in range(15) :
#     print(i)


# for i in range(10) :
#     print("HELOW")


# i =0
# while i < 5 :
#     print("HELOW")
#     i += 1








# მომხმარებელს შემოატანინე თავისი ასაკი და შეამოწმე თუ არის 18ზე 
# მეტი, გამოიტანე "სრულწლოვანი" თუ არის 18ის ტოლი გამოიტანე "შენ
# ხარ 18 წლის"
# სხვა შემთხვევაში გამოიტანე "პატარახარ"


# age = int(input("ჩაწერე შენი ასაკი რომ შეხვიდე აქაუნტრზე"))
# if age > 18 :
#     print("სრულწლოვანი ხარ")
# elif age == 18 :
#     print("ზუსტად 18 ხარ")
# else:
#     print("ბავშვი ხარ")























# ექმენით for ციკლი რომელიც მომხმარებელს შემოატანინებს
#  ციფრს 5 ჯერ და შემოტანის შემდეგ ეგრევე დაბეჭდავს

# for i in range(5):
#     print(input("semoitane cifri"))
    


# შექმენით for ციკლი რომელსაც range ნაცვლად
#    გადასცემთ რაიმე სტრინგს, და გამოიტანეთ 
# ამ სტრინგის თითოეული ასო ცალცალკე

# for i in "maausi":
#     print(i)




# შექმენით for ციკლი რომელსაც გადასცემთ range 10 და შიგნით გამოიიყენე selection, თუ კონკრეტულ 
# იტერაციაზე მყოფი რიცხვი იქნება კენტი,
#  დაბეჭდე ეს ციფრი და მიაწერე კენტიაა, თუ იქნება ლუწი დაბეჭდე და მიაწერე "ლუწია"

for i range