# '''დაწერე ფუნქცია, რომელიც ამოწმებს, თუ მოცემული სტრინგი არის 
# პალინდრომი (იგივეა როგორც წინ და უკან წაკითხვისას). 
# იგნორირება გაუკეთე დიდ და პატარა ასოებს.
#    - მაგალითი: `"ლეველ"` უნდა დააბრუნოს `True`.
# '''
# def palindromc_checker (string):
#     if string == string[::-1]:
#         return True
#     else: 
#         return False

# print(palindromc_checker('gio'))
# print(palindromc_checker('levl'))

""" დაწერე პროგრამა, რომელიც დაბეჭდავს რიცხვებს 1-დან 100-მდე. მაგრამ, სამის ჯერადებზე დაწერე "Fizz" რიცხვის ნაცვლად და ხუთის ჯერადებზე — "Buzz". იმ რიცხვებზე,
 რომლებიც როგორც სამის, ისე ხუთის ჯერადებია, დაწერე "FizzBuzz".
 დაწერე პროგრამა, რომელიც დაბეჭდავს რიცხვებს 1-დან 100-მდე. მაგრამ, სამის ჯერადებზე დაწერე "Fizz" რიცხვის ნაცვლად და ხუთის ჯერადებზე — "Buzz". იმ რიცხვებზე, რომლებიც როგორც სამის, ისე ხუთის ჯერადებია, დაწერე "FizzBuzz".
"""
# for i in range(100):
#     if i % 3 == 0 and i % 5 == 0:
#         print('fizzBuzz')
#     elif i % 3 == 0:
#         print('fizz')
#     elif i % 5 == 0:
#         print('Buzz')    


