# შექმენი ფუნქცია რომელსაც დაარქმევ სახელად sum და გადასცემ ორ არგუმენტს,
# ფუნქციის კოდის ბლოკში ანუ (ამ ფუნქციის
#  დანიშნულება კი იქნება შემდეგი:) პირველ ციფრს დაუმატე მეორე ციფრი


# def sum(nam1 ,nam2):
#     print(nam1+nam2)
# sum(6,110)


# შექმენი ფუნქცია რომელსაც დაარქმევ greetings და გადასცემ ერთ არგუმენტს (სახელს)  
# და ამ ფუნქციამ უნდა დაგვიბეჭდოს "Hello (და ის სახელი რაც გადავეცით)"

# def gretings(name):
#     print("helov", name)
# gretings("gio")











# მომხმარებელს შემოატანინე სახელი და
# დაუპრინტე მისი სახელის
# სიგრძე len() ფუნქციის მეშვეობით.


# ctr =input("enter your name")
# print(len(ctr))


# შექმენი საჭმელების სია, მომხმარებელს
# შემოატანინე ახალი საჭმელი და ეს შემოტანილ
# საჭმელი დაამატე შექმნილ სიაში .append() ფუნქციის მეშვეობით




# food = ["xinkali","mwvadi","wiwila"]
# falcon=input("ჩაწერე საჭმელი")
# food.append(falcon)
# print(food)



# შექმენი სახელების სია და მომხმარებელს შემოატანინე ინტეჯერი ციფრი, შემდეგ
# სახელების სიიდან ამოაგდე ელემენტი
# შემოტანილი რიცხვის ინდექსზე მყოფი, .pop() ფუნქციის მეშვეობით

# name =['gio','antony','vano']
# name1 = int(input("ჩაწერე ციფრი"))
# name.pop(name1)
# print(name)


# შექმენი სია რომელიც შედგება 4 ელემეტისგან
# და შუაში ჩაამატე კიდევ ახალი ელემენტი 
# insert() ფუნქციის მეშვეობით

# profesia=['მეხინკლე','ექიმი',"მძღოლი","ადამიანი"]
# profesia.insert(2,15)
# print(profesia)


















# მომხმარებელს შემოატანინე სახელი და დაბეჭდე მისი ყველა ვარიანტი
# (1.დიდი ასოებით / 2.პატარა ასოებით / 3.პირველი დიდი ასოთი)

# name = input("შემოიტანე სახელ")
# print(name.upper())
# print(name.lower())
# print(name.capitalize())


# მომხმარებელს შემოატანინე სტრინგი და
# დაბეჭდე ამ სტრინგში "g" ასოს ინდექსი (თუ არის)
 
# georgia = input('შემოიტანე ფრჩხილებში ჩაწერილი სიტყვა')
# print(georgia.find("g"))


# შექმენი სია (მინიმუმ 3 ელემენტი) და გადაუარე ამ სიას
# for ციკლით რო გამოიტანო ელემენტები ცალცალკე სათითაოდ

# qva = ['qva1','qva2','qva3']
# for i in qva:
#      print(i)





# მომხმარებელს შემოატანინე მისი გვარი და შეამოწმე if - else 
# მეშვეობით, თუ ეს 
# გვარი არის 9 სიმბოლოზე დიდი,
# მაშინ დაპრინტე "long surname" სხვა შემთხვევაში დაპრინტე "normal"

# uuu = input('ჩაწერე შენი გვარი')
# if len(uuu)>9:
#     print('longsurname')
# else:
#     print("normal")






# შექმენი სია შემდგარი სახელებისგამ, 
# მომხმარებელს შემოატანინე მისი სახელი
# და ჩასვი ამ სიის ბოლოში

# name = ['gio','merav','vaxo','adamiani','ronldo']
# xd = input("შემოიტანე სახელი")
# name.append(xd)
# print(name)


# შექმენი multiply ფუნქცია 
# რომელსაგ არგუმენტად გადაეცემა 
# ორი რიცხვი და დაგვიბრუნებს ამ
# რიცხვების ნამრავლს

# def name(a,b):
#     return a*b
# print(name(5,6))





























# /////მომხმარებელს შეაქმნევინე სია inputების მეშვეობით,
#  შიგნით შეიტანე 3 ელემენტი და საბოლოოდ დაპრინტე ეს სია ოღონდ შებრუნებული.
# ab=[]
# for i in range(3):
#     ab.append(input('შემოიტანე შენი სახელი'))
# print(ab)

# შექმენი ორი სია, ერთი შემდგარი სიტყვებისგან,
# მეორე ციფრებისგან, საბოლოო ჯამში გამოიტანე
# სიტყვების სია ანბანის მიხედვით დალაგებული 
# ხოლო ციფრების სია კლებადობის მიხედვით დალაგებული
# (reverse=True).

# anbani=['q', 'w', 'e' ,'r', 't','y', 'u','i', 'o', 'p','a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'z', 'x','c', 'v', 'b', 'n', 'm']
# cifrebi=[9,324,4545,6,78,88,9,5,9,9,5,9,8,5,9,0,2,67,89,554,3]
# anbani.sort()
# cifrebi.sort(reverse=True)
# print(anbani)
# print(cifrebi)


# შექმენი სია 5 ელემენტისგან და წაშალე ხუთივე ელემენტი.
# list=['gio','nika','dato','niko','mixail']
# list.clear()
# print(list)



# მომხმარებელს შემოატანინე რაღაც წინადადება და
# ასევე ასო, შემდეგ შეამოწმე რამდენჯერ მეორდება
# ეს ასო მომხმარებლის შემოტანილ წინადადებაშ


# gio = input('შემოიტანე წინადადება')
# gio1 =input('შემოიტანე ასო') 
# print(gio.count(gio1))





# მომხმარებელს შემოატანინე თავისი სახელი და თუ ეს
# სახელი ბოლოვდება "i" ასოთი, მაშინ დაუპრინტე
# "Welcome" სხვა შემთხვევაში "Leave".

# ctrl = input('შემოიტანე სახელი')
# if ctrl.endswith('i'):
#     print("welcome")
# else:
#     print('leave')