# სიის ელემენტების ჯამი**: დაწერე პროგრამა, რომელიც იღებს რიცხვების სიას და `for` ციკლით ითვლის ყველა ელემენტის ჯამს.

# number = [1,2,3,4,5,5,6,7]
# sum = 0
# for i in number :
#     sum    +=    i
# print(sum)

# ფაქტორიალის გამოთვლა**: დაწერე პროგრამა, რომელიც მოცემული რიცხვის ფაქტორიალს გამოთვლის `for` ციკლით.
# next


# სტრიქონის უკუღმა ჩაწერა**: შეიტანე სტრიქონი და გამოიყენე `for` ციკლი მის უკუღმა ჩასაწერად.
name = ("giorgi kheladze")
reversed_name=''
for i in range(0, len(name) ,-1):
    reversed_name+=[i]
print(reversed_name)                    